<a href="https://colab.research.google.com/github/YunusTamboli/Gen-AI/blob/main/introductionsession.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import math
x=int(input());
y=math.sqrt(x);
print(y);

5245
72.42237223399962

In [ ]:
a=int(input());
b=int(input());
a, b = b, a
print(a);
print(b);

10
20
20
10

In [ ]:
x=int(input())
if x>0:
  print("positive")
elif x<0:
  print("negative")
else:
  print("zero")

34
positive

In [ ]:
x=int(input())
if x%2==0:
  print("even")
else:
  print("odd")

43
odd

In [ ]:
x = int(input())
f = 1
for i in range(1, x + 1):
  f = f * i
print(f)

9
362880

In [ ]:
import pandas as pd
data={'name':["rahul","raj","ram"],
      'Age' :[20,34,23],
      'city':["bangalore","bjp","alur"]}
df=pd.DataFrame(data)
print(df)

    name  Age       city
0  rahul   20  bangalore
1    raj   34        bjp
2    ram   23       alur

In [ ]:
df.Age

0    20
1    34
2    23
Name: Age, dtype: int64

In [ ]:
df.Age>24

0    False
1     True
2    False
Name: Age, dtype: bool

In [ ]:
x=int(input())
for i in reversed(range(1,11)):
  print(i)